armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32L0xx/Keil.STM32L0xx_DFP.pdsc
        <debugvars configfile="CMSIS/Debug/STM32L0x1_0x2_0x3.dbgconf">
          __var DbgMCU_CR      = 0x00000006;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
        </debugvars>

        <algorithm name="CMSIS/Flash/STM32L01_2x_EEPROM.FLM" start="0x08080000" size="0x00000200" default="0"/>
        <algorithm name="CMSIS/Flash/STM32L0xx_OPT.FLM"      start="0x1FF80000" size="0x00000014" default="0"/>

        <book name="Documentation/DM00108282.pdf" title="STM32L0x1 Reference Manual"/>
        <book name="Documentation/DM00206508.pdf" title="STM32L011xx Data Sheet"/>

        <!-- *************************  Device 'STM32L011D3'  ***************************** -->
        <device Dname="STM32L011D3">
          <memory id="IROM1"                              start="0x08000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_8.FLM"   start="0x08000000" size="0x00002000"             default="1"/>

          <variant Dvariant="STM32L011D3Px"> <feature type="SOP" n="14"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L011D4'  ***************************** -->
        <device Dname="STM32L011D4">
          <memory id="IROM1"                              start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>

          <variant Dvariant="STM32L011D4Px"> <feature type="SOP" n="14"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L011E3'  ***************************** -->
        <!--device Dname="STM32L011E3">
          <memory id="IROM1"                        start="0x08000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                        start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_8.FLM"   start="0x08000000" size="0x00002000"             default="1"/>

          <variant Dvariant="STM32L011E3Yx"> <feature type="CSP" n="25"/> </variant>
        </device-->

        <!-- *************************  Device 'STM32L011E4'  ***************************** -->
        <device Dname="STM32L011E4">
          <memory id="IROM1"                              start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>

          <variant Dvariant="STM32L011E4Yx"> <feature type="CSP" n="25"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L011F3'  ***************************** -->
        <device Dname="STM32L011F3">
          <memory id="IROM1"                              start="0x08000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_8.FLM"   start="0x08000000" size="0x00002000"             default="1"/>

          <variant Dvariant="STM32L011F3Px"> <feature type="SOP" n="20"/> </variant>
          <variant Dvariant="STM32L011F3Ux"> <feature type="QFN" n="20"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L011F4'  ***************************** -->
        <device Dname="STM32L011F4">
          <memory id="IROM1"                              start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>

          <variant Dvariant="STM32L011F4Px"> <feature type="SOP" n="20"/> </variant>
          <variant Dvariant="STM32L011F4Ux"> <feature type="QFN" n="20"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L011G3'  ***************************** -->
        <device Dname="STM32L011G3">
          <memory id="IROM1"                              start="0x08000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_8.FLM"   start="0x08000000" size="0x00002000"             default="1"/>

          <variant Dvariant="STM32L011G3Ux"> <feature type="QFN" n="28"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L011G4'  ***************************** -->
        <device Dname="STM32L011G4">
          <memory id="IROM1"                              start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>

          <variant Dvariant="STM32L011G4Ux"> <feature type="QFN" n="28"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L011K3'  ***************************** -->
        <device Dname="STM32L011K3">
          <memory id="IROM1"                              start="0x08000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_8.FLM"   start="0x08000000" size="0x00002000"             default="1"/>

          <variant Dvariant="STM32L011K3Tx"> <feature type="QFP" n="32"/> </variant>
          <variant Dvariant="STM32L011K3Ux"> <feature type="QFN" n="32"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L011K4'  ***************************** -->
        <device Dname="STM32L011K4">
          <memory id="IROM1"                              start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>

