armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32L0xx/Keil.STM32L0xx_DFP.pdsc
        <!-- *************************  Device 'STM32L052R6'  ***************************** -->
        <device Dname="STM32L052R6">
          <memory id="IROM1"                              start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="UART"          n="1"       m="9600"            name="Low power universal asynchronous receiver transmitter"/>

          <variant Dvariant="STM32L052R6Hx"> <feature type="BGA" n="64"/> </variant>
          <variant Dvariant="STM32L052R6Tx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L052R8'  ***************************** -->
        <device Dname="STM32L052R8">
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="UART"          n="1"       m="9600"            name="Low power universal asynchronous receiver transmitter"/>

          <variant Dvariant="STM32L052R8Hx"> <feature type="BGA" n="64"/> </variant>
          <variant Dvariant="STM32L052R8Tx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L052T6'  ***************************** -->
        <device Dname="STM32L052T6">
          <memory id="IROM1"                              start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="37"/>

          <variant Dvariant="STM32L052T6Yx"> <feature type="CSP" n="36"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L052T8'  ***************************** -->
        <device Dname="STM32L052T8">
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1"/>

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="37"/>

          <variant Dvariant="STM32L052T8Yx"> <feature type="CSP" n="36"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L053'  **************************** -->
      <subFamily DsubFamily="STM32L053">
        <processor Dclock="32000000" Dmpu="MPU"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32L0xx/Include/stm32l0xx.h" define="STM32L053xx"/>
        <debug svd="CMSIS/SVD/STM32L053x.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32L0x1_0x2_0x3.dbgconf">
          __var DbgMCU_CR      = 0x00000006;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
        </debugvars>

        <algorithm name="CMSIS/Flash/STM32L05_6x_EEPROM.FLM" start="0x08080000" size="0x00000800" default="0"/>
        <algorithm name="CMSIS/Flash/STM32L0xx_OPT.FLM"      start="0x1FF80000" size="0x00000014" default="0"/>

        <book name="Documentation/DM00095744.pdf" title="STM32L0x3 Reference Manual"/>
        <book name="Documentation/DM00105960.pdf" title="STM32L053xx Data Sheet"/>

        <feature type="Touch"         n="24"                          name="Capacitive sensing channels supporting touchkey, linear and rotary touch sensors"/>
        <feature type="DAC"           n="1"       m="12"/>
        <feature type="UART"          n="1"       m="9600"            name="Low power universal asynchronous receiver transmitter"/>
        <feature type="USBD"          n="1"                           name="USB 2.0 crystal-less, battery charging detection and LPM"/>
        <feature type="SPI"           n="2"       m="16000000"/>

        <!-- *************************  Device 'STM32L053C6'  ***************************** -->
        <device Dname="STM32L053C6">
          <memory id="IROM1"                              start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="LCD"           n="1"       m="4.18"/>

          <variant Dvariant="STM32L053C6Tx"> <feature type="QFP" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L053C8'  ***************************** -->
        <device Dname="STM32L053C8">
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1"/>

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="LCD"           n="1"       m="4.18"/>

          <variant Dvariant="STM32L053C8Tx"> <feature type="QFP" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L053R6'  ***************************** -->
        <device Dname="STM32L053R6">
          <memory id="IROM1"                              start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="LCD"           n="1"       m="4.31"/>
          <feature type="LCD"           n="1"       m="8.28"/>

