armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32L0xx/Keil.STM32L0xx_DFP.pdsc
          <variant Dvariant="STM32L053R6Hx"> <feature type="BGA" n="64"/> </variant>
          <variant Dvariant="STM32L053R6Tx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L053R8'  ***************************** -->
        <device Dname="STM32L053R8">
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="LCD"           n="1"       m="4.31"/>
          <feature type="LCD"           n="1"       m="8.28"/>

          <variant Dvariant="STM32L053R8Hx"> <feature type="BGA" n="64"/> </variant>
          <variant Dvariant="STM32L053R8Tx"> <feature type="QFP" n="64"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L062'  **************************** -->
      <subFamily DsubFamily="STM32L062">
        <processor Dclock="32000000" Dmpu="MPU"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32L0xx/Include/stm32l0xx.h" define="STM32L062xx"/>
        <debug svd="CMSIS/SVD/STM32L062x.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32L0x1_0x2_0x3.dbgconf">
          __var DbgMCU_CR      = 0x00000006;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
        </debugvars>

        <algorithm name="CMSIS/Flash/STM32L05_6x_EEPROM.FLM" start="0x08080000" size="0x00000800" default="0"/>
        <algorithm name="CMSIS/Flash/STM32L0xx_OPT.FLM"      start="0x1FF80000" size="0x00000014" default="0"/>

        <book name="Documentation/DM00108281.pdf" title="STM32L0x2 Reference Manual"/>
        <book name="Documentation/DM00108218.pdf" title="STM32L062K8 Data Sheet"/>

        <!-- *************************  Device 'STM32L062K8'  ***************************** -->
        <device Dname="STM32L062K8">
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1"/>

          <feature type="Touch"         n="24"                          name="Capacitive sensing channels supporting touchkey, linear and rotary touch sensors"/>
          <feature type="Crypto"        n="1"                           name="Hardware Encryption Engine AES 128-bit"/>
          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="27"/>
          <feature type="DAC"           n="1"       m="12"/>
          <feature type="USBD"          n="1"                           name="USB 2.0 crystal-less, battery charging detection and LPM"/>
          <feature type="I2S"           n="2"/>

          <variant Dvariant="STM32L062K8Tx"> <feature type="QFP" n="32"/> </variant>
          <variant Dvariant="STM32L062K8Ux"> <feature type="QFN" n="32"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L063'  **************************** -->
      <subFamily DsubFamily="STM32L063">
        <processor Dclock="32000000" Dmpu="MPU"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32L0xx/Include/stm32l0xx.h" define="STM32L063xx"/>
        <debug svd="CMSIS/SVD/STM32L063x.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32L0x1_0x2_0x3.dbgconf">
          __var DbgMCU_CR      = 0x00000006;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
        </debugvars>

        <algorithm name="CMSIS/Flash/STM32L05_6x_EEPROM.FLM" start="0x08080000" size="0x00000800" default="0"/>
        <algorithm name="CMSIS/Flash/STM32L0xx_OPT.FLM"      start="0x1FF80000" size="0x00000014" default="0"/>

        <book name="Documentation/DM00095744.pdf" title="STM32L0x3 Reference Manual"/>
        <book name="Documentation/DM00102435.pdf" title="STM32L063xx Data Sheet"/>

        <feature type="Touch"         n="24"                          name="Capacitive sensing channels supporting touchkey, linear and rotary touch sensors"/>
        <feature type="Crypto"        n="1"                           name="Hardware Encryption Engine AES 128-bit"/>
        <feature type="DAC"           n="1"       m="12"/>
        <feature type="UART"          n="1"       m="9600"            name="Low power universal asynchronous receiver transmitter"/>
        <feature type="USBD"          n="1"                           name="USB 2.0 crystal-less, battery charging detection and LPM"/>
        <feature type="SPI"           n="2"       m="16000000"/>

        <!-- *************************  Device 'STM32L063C8'  ***************************** -->
        <device Dname="STM32L063C8">
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1"/>

          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="LCD"           n="1"       m="4.18"/>

          <variant Dvariant="STM32L063C8Tx"> <feature type="QFP" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L063R8'  ***************************** -->
        <device Dname="STM32L063R8">
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1"/>

          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="LCD"           n="1"       m="4.31"/>
          <feature type="LCD"           n="1"       m="8.28"/>

          <variant Dvariant="STM32L063R8Tx"> <feature type="QFP" n="64"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L071'  **************************** -->
      <subFamily DsubFamily="STM32L071">
        <processor Dclock="32000000" Dmpu="MPU"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32L0xx/Include/stm32l0xx.h" define="STM32L071xx"/>
        <debug svd="CMSIS/SVD/STM32L0x1.svd"/>

