armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32L0xx/Keil.STM32L0xx_DFP.pdsc
        <debugvars configfile="CMSIS/Debug/STM32L0x1_0x2_0x3.dbgconf">
          __var DbgMCU_CR      = 0x00000006;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
        </debugvars>

        <algorithm name="CMSIS/Flash/STM32L0xx_OPT.FLM"    start="0x1FF80000" size="0x00000014" default="0"/>

        <book name="Documentation/DM00108281.pdf" title="STM32L0x2 Reference Manual"/>
        <book name="Documentation/DM00141133.pdf" title="STM32L072xx Data Sheet"/>

        <!-- *************************  Device 'STM32L072CB'  ***************************** -->
        <device Dname="STM32L072CB">
          <memory id="IROM1"                                   start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                                   start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_128.FLM"      start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L072CBTx"> <feature type="QFP" n="48"/> </variant>
          <variant Dvariant="STM32L072CBYx"> <feature type="CSP" n="49"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L072CZ'  ***************************** -->
        <device Dname="STM32L072CZ">
          <memory id="IROM1"                                   start="0x08000000" size="0x00030000" startup="1" default="1"/>
          <memory id="IRAM1"                                   start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_192.FLM"      start="0x08000000" size="0x00030000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L072CZTx"> <feature type="QFP" n="48"/> </variant>
          <variant Dvariant="STM32L072CZYx"> <feature type="CSP" n="49"/> </variant>
          <variant Dvariant="STM32L072CZEx"> <feature type="CSP" n="49"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L072KB'  ***************************** -->
        <device Dname="STM32L072KB">
          <memory id="IROM1"                                   start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                                   start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_128.FLM"      start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L072KBTx"> <feature type="QFP" n="32"/> </variant>
          <variant Dvariant="STM32L072KBUx"> <feature type="QFN" n="32"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L072KZ'  ***************************** -->
        <device Dname="STM32L072KZ">
          <memory id="IROM1"                                   start="0x08000000" size="0x00030000" startup="1" default="1"/>
          <memory id="IRAM1"                                   start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_192.FLM"      start="0x08000000" size="0x00030000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L072KZTx"> <feature type="QFP" n="32"/> </variant>
          <variant Dvariant="STM32L072KZUx"> <feature type="QFN" n="32"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L072RB'  ***************************** -->
        <device Dname="STM32L072RB">
          <memory id="IROM1"                                   start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                                   start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_128.FLM"      start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L072RBHx"> <feature type="BGA" n="64"/> </variant>
          <variant Dvariant="STM32L072RBIx"> <feature type="BGA" n="64"/> </variant>
          <variant Dvariant="STM32L072RBTx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L072RZ'  ***************************** -->
        <device Dname="STM32L072RZ">
          <memory id="IROM1"                                   start="0x08000000" size="0x00030000" startup="1" default="1"/>
          <memory id="IRAM1"                                   start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_192.FLM"      start="0x08000000" size="0x00030000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L072RZHx"> <feature type="BGA" n="64"/> </variant>
          <variant Dvariant="STM32L072RZIx"> <feature type="BGA" n="64"/> </variant>
          <variant Dvariant="STM32L072RZTx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L072V8'  ***************************** -->
        <device Dname="STM32L072V8">
          <memory id="IROM1"                                     start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                                     start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_64.FLM"         start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32L07x_64_EEPROM.FLM"  start="0x08080C00" size="0x00000800"             default="0"/>

          <variant Dvariant="STM32L072V8Ix"> <feature type="BGA" n="100"/> </variant>
          <variant Dvariant="STM32L072V8Tx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L072VB'  ***************************** -->
        <device Dname="STM32L072VB">
          <memory id="IROM1"                                   start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                                   start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_128.FLM"      start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L072VBIx"> <feature type="BGA" n="100"/> </variant>
          <variant Dvariant="STM32L072VBTx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L072VZ'  ***************************** -->
        <device Dname="STM32L072VZ">
          <memory id="IROM1"                                   start="0x08000000" size="0x00030000" startup="1" default="1"/>
          <memory id="IRAM1"                                   start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_192.FLM"      start="0x08000000" size="0x00030000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L072VZIx"> <feature type="BGA" n="100"/> </variant>
          <variant Dvariant="STM32L072VZTx"> <feature type="QFP" n="100"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L073'  **************************** -->
      <subFamily DsubFamily="STM32L073">
        <processor Dclock="32000000" Dmpu="MPU"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32L0xx/Include/stm32l0xx.h" define="STM32L073xx"/>
        <debug svd="CMSIS/SVD/STM32L07x.svd"/>

