armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32L0xx/Keil.STM32L0xx_DFP.pdsc
        <debugvars configfile="CMSIS/Debug/STM32L0x1_0x2_0x3.dbgconf">
          __var DbgMCU_CR      = 0x00000006;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
        </debugvars>

        <algorithm name="CMSIS/Flash/STM32L0xx_OPT.FLM"    start="0x1FF80000" size="0x00000014" default="0"/>

        <book name="Documentation/DM00095744.pdf" title="STM32L0x3 Reference Manual"/>
        <book name="Documentation/DM00141036.pdf" title="STM32L073xx Data Sheet"/>

        <!-- *************************  Device 'STM32L073CB'  ***************************** -->
        <device Dname="STM32L073CB">
          <memory id="IROM1"                                   start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                                   start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_128.FLM"      start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L073CBTx"> <feature type="QFP" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L073CZ'  ***************************** -->
        <device Dname="STM32L073CZ">
          <memory id="IROM1"                                   start="0x08000000" size="0x00030000" startup="1" default="1"/>
          <memory id="IRAM1"                                   start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_192.FLM"      start="0x08000000" size="0x00030000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L073CZTx"> <feature type="QFP" n="48"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L073RB'  ***************************** -->
        <device Dname="STM32L073RB">
          <memory id="IROM1"                                   start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                                   start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_128.FLM"      start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L073RBHx"> <feature type="BGA" n="64"/> </variant>
          <variant Dvariant="STM32L073RBTx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L073RZ'  ***************************** -->
        <device Dname="STM32L073RZ">
          <memory id="IROM1"                                   start="0x08000000" size="0x00030000" startup="1" default="1"/>
          <memory id="IRAM1"                                   start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_192.FLM"      start="0x08000000" size="0x00030000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L073RZHx"> <feature type="BGA" n="64"/> </variant>
          <variant Dvariant="STM32L073RZTx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L073V8'  ***************************** -->
        <device Dname="STM32L073V8">
          <memory id="IROM1"                                    start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                                    start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_64.FLM"        start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32L07x_64_EEPROM.FLM" start="0x08080C00" size="0x00000800"             default="0"/>

          <variant Dvariant="STM32L073V8Ix"> <feature type="BGA" n="100"/> </variant>
          <variant Dvariant="STM32L073V8Tx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L073VB'  ***************************** -->
        <device Dname="STM32L073VB">
          <memory id="IROM1"                                   start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                                   start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_128.FLM"      start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L073VBIx"> <feature type="BGA" n="100"/> </variant>
          <variant Dvariant="STM32L073VBTx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L073VZ'  ***************************** -->
        <device Dname="STM32L073VZ">
          <memory id="IROM1"                                   start="0x08000000" size="0x00030000" startup="1" default="1"/>
          <memory id="IRAM1"                                   start="0x20000000" size="0x00005000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L0xx_192.FLM"      start="0x08000000" size="0x00030000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32L07_8x_EEPROM.FLM" start="0x08080000" size="0x00001800"             default="0"/>

          <variant Dvariant="STM32L073VZIx"> <feature type="BGA" n="100"/> </variant>
          <variant Dvariant="STM32L073VZTx"> <feature type="QFP" n="100"/> </variant>
        </device>
      </subFamily>

