armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32L0xx/Keil.STM32L0xx_DFP.pdsc
    <condition id="STM32L073 CMSIS">
      <description>STMicroelectronics STM32L073 Devices and CMSIS-Core</description>
      <require condition="STM32L073"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L081 CMSIS">
      <description>STMicroelectronics STM32L081 Devices and CMSIS-Core</description>
      <require condition="STM32L081"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L082 CMSIS">
      <description>STMicroelectronics STM32L082 Devices and CMSIS-Core</description>
      <require condition="STM32L082"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L083 CMSIS">
      <description>STMicroelectronics STM32L083 Devices and CMSIS-Core</description>
      <require condition="STM32L083"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    
        <!-- Device + Compiler Conditions -->
    <condition id="STM32L0 ARMCC">
      <description>STMicroelectronics STM32L011 Devices and ARMCC Compiler</description>
      <require condition="STM32L0"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L011 ARMCC">
      <description>STMicroelectronics STM32L011 Devices and ARMCC Compiler</description>
      <require condition="STM32L011"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L021 ARMCC">
      <description>STMicroelectronics STM32L021 Devices and ARMCC Compiler</description>
      <require condition="STM32L021"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L031 ARMCC">
      <description>STMicroelectronics STM32L031 Devices and ARMCC Compiler</description>
      <require condition="STM32L031"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L041 ARMCC">
      <description>STMicroelectronics STM32L041 Devices and ARMCC Compiler</description>
      <require condition="STM32L041"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L051 ARMCC">
      <description>STMicroelectronics STM32L051 Devices and ARMCC Compiler</description>
      <require condition="STM32L051"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L052 ARMCC">
      <description>STMicroelectronics STM32L052 Devices and ARMCC Compiler</description>
      <require condition="STM32L052"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L053 ARMCC">
      <description>STMicroelectronics STM32L053 Devices and ARMCC Compiler</description>
      <require condition="STM32L053"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <!--condition id="STM32L061 ARMCC">
      <description>STMicroelectronics STM32L061 Devices and ARMCC Compiler</description>
      <require condition="STM32L061"/>
      <require condition="Compiler ARMCC"/>
    </condition-->
    <condition id="STM32L062 ARMCC">
      <description>STMicroelectronics STM32L062 Devices and ARMCC Compiler</description>
      <require condition="STM32L062"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L063 ARMCC">
      <description>STMicroelectronics STM32L063 Devices and ARMCC Compiler</description>
      <require condition="STM32L063"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L071 ARMCC">
      <description>STMicroelectronics STM32L071 Devices and ARMCC Compiler</description>
      <require condition="STM32L071"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L072 ARMCC">
      <description>STMicroelectronics STM32L072 Devices and ARMCC Compiler</description>
      <require condition="STM32L072"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L073 ARMCC">
      <description>STMicroelectronics STM32L073 Devices and ARMCC Compiler</description>
      <require condition="STM32L073"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L081 ARMCC">
      <description>STMicroelectronics STM32L081 Devices and ARMCC Compiler</description>
      <require condition="STM32L081"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L082 ARMCC">
      <description>STMicroelectronics STM32L082 Devices and ARMCC Compiler</description>
      <require condition="STM32L082"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L083 ARMCC">
      <description>STMicroelectronics STM32L083 Devices and ARMCC Compiler</description>
      <require condition="STM32L083"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <!-- Device + CMSIS + STM32CubeMX Conditions -->
    <condition id="STM32L0 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32L011 Devices, CMSIS-Core and STM32CubeMX</description>
      <require condition="STM32L0"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32L011 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32L011 Devices, CMSIS-Core and STM32CubeMX</description>
      <require condition="STM32L011"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32L021 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32L021 Devices, CMSIS-Core and STM32CubeMX</description>
      <require condition="STM32L021"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32L031 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32L031 Devices, CMSIS-Core and STM32CubeMX</description>
      <require condition="STM32L031"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32L041 CMSI STM32CubeMXS">
      <description>STMicroelectronics STM32L041 Devices, CMSIS-Core and STM32CubeMX</description>
      <require condition="STM32L041"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32L051 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32L051 Devices, CMSIS-Core and STM32CubeMX</description>
      <require condition="STM32L051"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32L052 CMSISv">
      <description>STMicroelectronics STM32L052 Devices, CMSIS-Core and STM32CubeMX</description>
      <require condition="STM32L052"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32L053 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32L053 Devices, CMSIS-Core and STM32CubeMX</description>
      <require condition="STM32L053"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <!--condition id="STM32L061 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32L061 Devices, CMSIS-Core and STM32CubeMX</description>
      <require condition="STM32L061"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition-->
    <condition id="STM32L062 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32L062 Devices, CMSIS-Core and STM32CubeMX</description>
      <require condition="STM32L062"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32L063 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32L063 Devices, CMSIS-Core and STM32CubeMX</description>
      <require condition="STM32L063"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32L071 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32L071 Devices, CMSIS-Core and STM32CubeMX</description>
      <require condition="STM32L071"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
