armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32L0xx/Keil.STM32L0xx_DFP.pdsc
    <condition id="STM32L072 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32L072 Devices, CMSIS-Core and STM32CubeMX</description>
      <require condition="STM32L072"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32L073 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32L073 Devices, CMSIS-Core and STM32CubeMX</description>
      <require condition="STM32L073"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32L081 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32L081 Devices, CMSIS-Core and STM32CubeMX</description>
      <require condition="STM32L081"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32L082 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32L082 Devices, CMSIS-Core and STM32CubeMX</description>
      <require condition="STM32L082"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32L083 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32L083 Devices, CMSIS-Core and STM32CubeMX</description>
      <require condition="STM32L083"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>

    <condition id="STM32L0 STARTUP CORTEX GPIO PWR RCC FLASH">
      <description>STMicroelectronics STM32L0 devices, Startup and HAL CORTEX, GPIO, RCC and FLASH</description>
      <require condition="STM32L0"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="Startup"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="CORTEX"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="PWR"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="FLASH"/>
    </condition>
    <condition id="STM32L0 HAL">
      <description>STMicroelectronics STM32L0 devices and HAL </description>
      <require condition="STM32L0"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="COMMON"/>
    </condition>
    <condition id="STM32L0 HAL DMA">
      <description>STMicroelectronics STM32L0 Devices, HAL, and DMA peripheral</description>
      <require condition="STM32L0 HAL"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32L0 LL">
      <description>STMicroelectronics STM32L0 devices and LL </description>
      <require condition="STM32L0"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube LL" Csub="COMMON"/>
    </condition>
    <condition id="STM32L0 STARTUP LL UTILS RCC PWR">
      <description>STMicroelectronics STM32L0 Device and LL</description>
      <require condition="STM32L0"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="Startup"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube LL" Csub="UTILS"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube LL" Csub="RCC"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube LL" Csub="PWR"/>
    </condition>
  </conditions>
 
  <generators>
    <!-- This generator is launched if any component referencing this generator by 'id' is selected and the specified <gpdsc> file does not exist -->
    <generator id="STM32CubeMX">
      <description>ST Microelectronics: STCubeMX Environment</description>
      <command>MDK/CubeMX/STM32CubeMxLauncher.exe</command> <!-- path is specified either absolute or relative to PDSC or GPDSC file -->
      <workingDir>$PRTE/Device</workingDir> <!-- path is specified either absolute or relative to PDSC or GPDSC file. If not specified it is the project directory configured by the environment -->
      <arguments>
        <!-- D = Device (Dname/Dvariant as configured by environment) -->
        <argument>$D</argument>
        <!-- Project path and project name (as configured by environment) -->
        <argument>#P</argument>
        <!-- absolute or relative to workingDir. $S = Device Family Pack base folder -->
        <argument>$S</argument>
      </arguments>
      <!-- path is either absolute or relative to working directory -->
      <gpdsc name="$PRTE/Device/$D/FrameworkCubeMX.gpdsc"/>
    </generator>
  </generators>

  <apis>
    <api Cclass="Device" Cgroup="STM32Cube Framework" Capiversion="1.0.0" exclusive="1">
      <description>STM32Cube Framework</description>
      <files>
        <file category="doc" name="MDK/CubeMX/Documentation/index.html"/>
      </files>
    </api>
  </apis>

  <components>
    <bundle Cbundle="STM32CubeMX" Cclass="Device" isDefaultVariant="true" Cversion="1.0.0">
      <description>Peripheral, Clock and Pin configuration are managed by STM32CubeMX</description>
      <doc>MDK/CubeMX/Documentation/index.html</doc>
      <component Cgroup="Startup" Cversion="1.7.2" condition="STM32L0 CMSIS STM32CubeMX">  <!-- Cversion is necessary -->
        <description>System Startup for STMicroelectronics STM32L0 Series</description>
        <RTE_Components_h>
          <!-- the following content goes into file 'RTE_Components.h' -->
          #define RTE_DEVICE_STARTUP_STM32L0XX    /* Device Startup for STM32L0 */
        </RTE_Components_h>

        <files>
          <!-- Flash Option Bytes templates -->
          <file category="source"   name="MDK/Device/Source/ARM/STM32L0xx_OPT.s"       attr="template" version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes"/>
        </files>
      </component>

      <component generator="STM32CubeMX" Cgroup="STM32Cube Framework" Csub="STM32CubeMX" Cversion="1.0.0" condition="STM32L0">
        <description>Configuration via STM32CubeMX</description>
        <RTE_Components_h>
          #define RTE_DEVICE_FRAMEWORK_CUBE_MX
        </RTE_Components_h>
        <files>
          <file category="doc"     name="MDK/CubeMX/Documentation/cubemx.html"/>
          <file category="source"  name="MDK/CubeMX/run_STM32CubeMX.c" version="1.0.0"/>
          <file category="other"   name="MDK/CubeMX/FrameworkCubeMX_gpdsc.ftl" version="1.0.0"/>
          <file category="other"   name="MDK/CubeMX/MX_Device_h.ftl" version ="1.0.1"/>
        </files>
      </component>

      <component Cgroup="STM32Cube HAL" Cversion="1.8.2" condition="STM32L0 CMSIS STM32CubeMX">
        <description>STM32Cube HAL Drivers</description>
        <RTE_Components_h>
          #define RTE_DEVICE_CUBE_MX_HAL
        </RTE_Components_h>
        <files>
          <file category="source"  name="MDK/Driver/stm32l0xx_ll.c"/>
          <file category="include" name="Drivers/STM32L0xx_HAL_Driver/Inc/"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_adc.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_adc_ex.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_comp.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_comp_ex.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_cortex.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_crc.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_crc_ex.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_cryp.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_cryp_ex.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_dac.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_dac_ex.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_dma.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_firewall.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_flash.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_flash_ex.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_flash_ramfunc.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_gpio.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_i2c.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_i2c_ex.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_i2s.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_irda.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_iwdg.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_lcd.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_lptim.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_pcd.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_pcd_ex.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_pwr.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_pwr_ex.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_rcc.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_rcc_ex.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_rng.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_rtc.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_rtc_ex.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_smartcard.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_smartcard_ex.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_smbus.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_spi.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_tim.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_tim_ex.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_tsc.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_uart.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_uart_ex.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_usart.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_wwdg.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_adc.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_comp.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_crc.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_crs.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_dac.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_dma.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_exti.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_gpio.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_i2c.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_lptim.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_lpuart.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_pwr.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_rcc.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_rng.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_rtc.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_spi.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_tim.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_usart.c"/>
          <file category="source"  name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_ll_utils.c"/>
        </files>
      </component>
    </bundle>

    <bundle Cbundle="Standalone" Cclass="Device" Cversion="1.0.0">
      <description>All HAL and LL peripheral APIs are selectable as individual components.</description>
      <doc>Documentation/STM32CubeL0GettingStarted.pdf</doc>
      <component  Cgroup="Startup" condition="STM32L0 CMSIS">
        <description>System Startup for STMicroelectronics</description>
        <RTE_Components_h>
          #define RTE_DEVICE_STARTUP_STM32L0XX    /* Device Startup for STM32L0 */
        </RTE_Components_h>

        <files>
          <!--  include folder -->

          <file category="include" name="Drivers/CMSIS/Device/ST/STM32L0xx/Include/"/>

          <!-- Flash Option Bytes templates -->
          <file category="source" condition="STM32L0 ARMCC" name="MDK/Device/Source/ARM/STM32L0xx_OPT.s" attr="template" select="Flash Option Bytes"/>

          <file category="header" name="Drivers/CMSIS/Device/ST/STM32L0xx/Include/stm32l0xx.h"/>

          <!-- startup files -->
          <!-- ARM Compiler Toolchain -->
          <file category="source" condition="STM32L011 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L0xx/Source/Templates/arm/startup_stm32l011xx.s" attr="config" version="2.3.3"/>
          <file category="source" condition="STM32L021 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L0xx/Source/Templates/arm/startup_stm32l021xx.s" attr="config" version="2.3.3"/>
          <file category="source" condition="STM32L031 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L0xx/Source/Templates/arm/startup_stm32l031xx.s" attr="config" version="2.3.3"/>
          <file category="source" condition="STM32L041 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L0xx/Source/Templates/arm/startup_stm32l041xx.s" attr="config" version="2.3.3"/>
          <file category="source" condition="STM32L051 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L0xx/Source/Templates/arm/startup_stm32l051xx.s" attr="config" version="2.3.3"/>
          <file category="source" condition="STM32L052 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L0xx/Source/Templates/arm/startup_stm32l052xx.s" attr="config" version="2.3.3"/>
          <file category="source" condition="STM32L053 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L0xx/Source/Templates/arm/startup_stm32l053xx.s" attr="config" version="2.3.3"/>
<!--
          <file category="source" condition="STM32L061 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L0xx/Source/Templates/arm/startup_stm32l061xx.s" attr="config" version="2.3.3"/>
-->
          <file category="source" condition="STM32L062 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L0xx/Source/Templates/arm/startup_stm32l062xx.s" attr="config" version="2.3.3"/>
          <file category="source" condition="STM32L063 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L0xx/Source/Templates/arm/startup_stm32l063xx.s" attr="config" version="2.3.3"/>
          <file category="source" condition="STM32L071 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L0xx/Source/Templates/arm/startup_stm32l071xx.s" attr="config" version="2.3.3"/>
          <file category="source" condition="STM32L072 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L0xx/Source/Templates/arm/startup_stm32l072xx.s" attr="config" version="2.3.3"/>
          <file category="source" condition="STM32L073 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L0xx/Source/Templates/arm/startup_stm32l073xx.s" attr="config" version="2.3.3"/>
          <file category="source" condition="STM32L081 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L0xx/Source/Templates/arm/startup_stm32l081xx.s" attr="config" version="2.3.3"/>
          <file category="source" condition="STM32L082 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L0xx/Source/Templates/arm/startup_stm32l082xx.s" attr="config" version="2.3.3"/>
          <file category="source" condition="STM32L083 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32L0xx/Source/Templates/arm/startup_stm32l083xx.s" attr="config" version="2.3.3"/>

          <!-- system file -->
          <file category="source" name="Drivers/CMSIS/Device/ST/STM32L0xx/Source/Templates/system_stm32l0xx.c" attr="config" version="2.3.3"/>
        </files>
      </component>

