armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32L0xx/Keil.STM32L0xx_DFP.pdsc
      <!-- STM32L0xx HAL Drivers -->
      <component Cgroup="STM32Cube HAL" Csub="COMMON" Cversion="1.8.2" condition="STM32L0 STARTUP CORTEX GPIO PWR RCC FLASH">
        <description>Common HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_COMMON
        </RTE_Components_h>
        <files>
          <file category="header" name="Drivers/STM32L0xx_HAL_Driver/Inc/Legacy/stm32_hal_legacy.h"/>
          <file category="header" name="Drivers/STM32L0xx_HAL_Driver/Inc/stm32l0xx_hal.h"/>
          <file category="header" name="Drivers/STM32L0xx_HAL_Driver/Inc/stm32l0xx_hal_def.h"/>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal.c"/>
          <file category="header" name="MDK/Templates/Inc/stm32l0xx_hal_conf.h" attr="config"   version="1.9.0"/>
          <file category="source" name="MDK/Templates/Src/stm32l0xx_hal_msp.c"  attr="template" select="MCU Specific HAL Initialization / De-Initialization"/>
          <file category="header" name="MDK/Templates/Inc/stm32l0xx_it.h"       attr="template" select="Exception Handlers and Peripheral IRQ"/>
          <file category="source" name="MDK/Templates/Src/stm32l0xx_it.c"       attr="template" select="Exception Handlers and Peripheral IRQ"/>
          <file category="header" name="MDK/Templates/Inc/main.h"               attr="template" select="'main' module for STM32Cube"/>
          <file category="source" name="MDK/Templates/Src/main.c"               attr="template" select="'main' module for STM32Cube"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="ADC" Cversion="1.8.2" condition="STM32L0 HAL DMA">
        <description>Analog-to-digital converter (ADC) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_ADC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_adc.c"/>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_adc_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="COMP" Cversion="1.8.2" condition="STM32L0 HAL">
        <description>Analog Comparator (COMP) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_COMP
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_comp.c"/>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_comp_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="CORTEX" Cversion="1.8.2" condition="STM32L0 HAL">
        <description>Cortex HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_CORTEX
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_cortex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="CRC" Cversion="1.8.2" condition="STM32L0 HAL">
        <description>CRC calculation unit (CRC) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_CRC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_crc.c"/>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_crc_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="CRYP" Cversion="1.8.2" condition="STM32L0 HAL DMA">
        <description>Cryptography  peripheral (CRYP) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_CRYP
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_cryp.c"/>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_cryp_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="DAC" Cversion="1.8.2" condition="STM32L0 HAL DMA">
        <description>Digital-to-analog converter (DAC) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_DAC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_dac.c"/>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_dac_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="DMA" Cversion="1.8.2" condition="STM32L0 HAL">
        <description>DMA controller (DMA) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_DMA
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_dma.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="FIREWALL" Cversion="1.8.2" condition="STM32L0 HAL">
        <description>Firewall HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_FIREWALL
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_firewall.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="FLASH" Cversion="1.8.2" condition="STM32L0 HAL">
        <description>Embedded Flash memory HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_FLASH
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_flash.c"/>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_flash_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="GPIO" Cversion="1.8.2" condition="STM32L0 HAL">
        <description>General-purpose I/O (GPIO) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_GPIO
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_gpio.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="I2C" Cversion="1.8.2" condition="STM32L0 HAL DMA">
        <description>Inter-integrated circuit (I2C) interface HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_I2C
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_i2c.c"/>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_i2c_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="I2S" Cversion="1.8.2" condition="STM32L0 HAL DMA">
        <description>Interchip sound (I2S) interface HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_I2S
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_i2s.c"/>
        </files>
      </component>
