armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32L0xx/Keil.STM32L0xx_DFP.pdsc
      <component Cgroup="STM32Cube HAL" Csub="IRDA" Cversion="1.8.2" condition="STM32L0 HAL DMA">
        <description>IrDA HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_IRDA
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_irda.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="IWDG" Cversion="1.8.2" condition="STM32L0 HAL">
        <description>Independent watchdog (IWDG) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_IWDG
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_iwdg.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="LCD" Cversion="1.8.2" condition="STM32L0 HAL">
        <description>LCD peripheral HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_LCD
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_lcd.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="LPTIM" Cversion="1.8.2" condition="STM32L0 HAL">
        <description>Low Power Timer peripheral HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_LPTIM
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_lptim.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="PCD" Cversion="1.8.2" condition="STM32L0 HAL">
        <description>USB Peripheral controller (PCD) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_PCD
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_pcd.c"/>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_pcd_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="PWR" Cversion="1.8.2" condition="STM32L0 HAL">
        <description>Power controller (PWR) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_PWR
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_pwr.c"/>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_pwr_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="RCC" Cversion="1.8.2" condition="STM32L0 HAL">
        <description>Reset and clock control (RCC) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_RCC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_rcc.c"/>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_rcc_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="RNG" Cversion="1.8.2" condition="STM32L0 HAL">
        <description>Random Number Generator (RNG) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_RNG
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_rng.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="RTC" Cversion="1.8.2" condition="STM32L0 HAL">
        <description>Real-time clock (RTC) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_RTC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_rtc.c"/>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_rtc_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="SMARTCARD" Cversion="1.8.2" condition="STM32L0 HAL DMA">
        <description>Smartcard HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_SMARTCARD
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_smartcard.c"/>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_smartcard_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="SMBUS" Cversion="1.8.2" condition="STM32L0 HAL">
        <description>System Management Bus (SMBUS) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_SMBUS
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_smbus.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="SPI" Cversion="1.8.2" condition="STM32L0 HAL DMA">
        <description>Serial peripheral interface (SPI) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_SPI
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_spi.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="TIM" Cversion="1.8.2" condition="STM32L0 HAL DMA">
        <description>Timers (TIM) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_TIM
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_tim.c"/>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_tim_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="TSC" Cversion="1.8.2" condition="STM32L0 HAL">
        <description>Touch Sensing Controller (TSC) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_TSC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32L0xx_HAL_Driver/Src/stm32l0xx_hal_tsc.c"/>
        </files>
      </component>
